# 7. Создать (не программно) текстовый файл, в котором каждая строка должна содержать данные о фирме: название, форма собственности, выручка, издержки.
# Пример строки файла: firm_1 ООО 10000 5000.
# Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль. Если фирма получила убытки, в расчет средней прибыли ее не включать.
# Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями, а также словарь со средней прибылью.
# Если фирма получила убытки, также добавить ее в словарь (со значением убытков).
# Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
# Итоговый список сохранить в виде json-объекта в соответствующий файл.
# Пример json-объекта:
# [{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
#
# Подсказка: использовать менеджеры контекста.

import json

with open('file7.txt', 'r') as f:
    firm_list = {}
    average_profit = 0
    average_profit_new = {}
    for line in f.readlines():
        lines = line.split(' ')
        for i in lines:
            profit = int(lines[2]) - int(lines[3])
        firm_list[lines[0]] = profit
        average_profit += profit
    average_profit_new['Средняя прибыль'] = profit
    result = [firm_list, average_profit_new]
    with open('info.json', 'w') as j:
        json.dump(result, j)